[{"id":1,"receita":"Frango Agridoce","ingredientes":"500g de peito de frango em cubos, 1 pimentão vermelho fatiado, 1 pimentão verde fatiado, 1 cebola cortada em pedaços grandes, 1 cenoura fatiada, 1 abacaxi em pedaços, 2 colheres de sopa de molho de soja, 2 colheres de sopa de vinagre de arroz, 3 colheres de sopa de ketchup, 2 colheres de sopa de açúcar, 1 colher de chá de amido de milho, sal e pimenta a gosto","modo_preparo":"1. Tempere o frango com sal e pimenta. 2. Em uma frigideira grande, aqueça um pouco de óleo e refogue o frango até dourar. 3. Adicione os pimentões, a cebola, a cenoura e refogue por mais alguns minutos. 4. Em uma tigela, misture o molho de soja, vinagre, ketchup, açúcar e amido de milho. 5. Adicione o abacaxi e a mistura de molho à frigideira. 6. Cozinhe até que o molho engrosse e cubra bem os ingredientes. 7. Sirva quente.","link_imagem":"https://media-cdn.tripadvisor.com/media/photo-s/1a/c8/90/f6/frango-agri-doce-rodizio.jpg","tipo":"agridoce","created_at":"2024-08-11T22:02:58.854Z","IngredientesBase":[{"id":1,"nomesIngrediente":["peito de frango","pimentão vermelho","pimentão verde","cebola","cenoura","abacaxi","molho de soja","vinagre de arroz","ketchup","açúcar","amido de milho","sal","pimenta"],"receita_id":1,"created_at":"2024-08-11T22:02:58.854Z"}]},{"id":2,"receita":"Salada Grega","ingredientes":"2 tomates cortados em cubos, 1 pepino fatiado, 1 cebola roxa fatiada, 1 pimentão verde fatiado, 100g de queijo feta esfarelado, 10 azeitonas pretas, 2 colheres de sopa de azeite de oliva, 1 colher de sopa de suco de limão, orégano seco a gosto, sal e pimenta a gosto","modo_preparo":"1. Em uma tigela grande, misture os tomates, o pepino, a cebola e o pimentão. 2. Adicione o queijo feta e as azeitonas. 3. Em uma tigela pequena, misture o azeite de oliva, o suco de limão, o orégano, o sal e a pimenta. 4. Despeje o molho sobre a salada e misture bem. 5. Sirva imediatamente.","link_imagem":"https://i.ytimg.com/vi/3wJH3dYE8Ng/maxresdefault.jpg","tipo":"salgado","created_at":"2024-08-11T22:03:18.948Z","IngredientesBase":[{"id":2,"nomesIngrediente":["tomates","pepino","cebola roxa","pimentão verde","queijo feta","azeitonas pretas","azeite de oliva","suco de limão","orégano","sal","pimenta"],"receita_id":2,"created_at":"2024-08-11T22:03:18.948Z"}]},{"id":3,"receita":"Panquecas Americanas","ingredientes":"1 xícara de farinha de trigo, 1 colher de sopa de açúcar, 1 colher de chá de fermento em pó, 1/2 colher de chá de bicarbonato de sódio, 1/4 colher de chá de sal, 1 xícara de leite, 1 ovo, 2 colheres de sopa de manteiga derretida, 1 colher de chá de essência de baunilha","modo_preparo":"1. Em uma tigela, misture a farinha, o açúcar, o fermento, o bicarbonato e o sal. 2. Em outra tigela, bata o leite, o ovo, a manteiga derretida e a baunilha. 3. Adicione os ingredientes líquidos aos secos e misture até obter uma massa homogênea. 4. Aqueça uma frigideira untada em fogo médio e despeje pequenas porções de massa, cozinhando até que apareçam bolhas na superfície. 5. Vire as panquecas e cozinhe até dourar o outro lado.","link_imagem":"https://i.pinimg.com/originals/bd/86/82/bd8682378b450e103c2e36cd29be60cb.png","tipo":"doce","created_at":"2024-08-11T22:03:27.818Z","IngredientesBase":[{"id":3,"nomesIngrediente":["farinha de trigo","açúcar","fermento em pó","bicarbonato de sódio","sal","leite","ovo","manteiga","essência de baunilha"],"receita_id":3,"created_at":"2024-08-11T22:03:27.818Z"}]},{"id":4,"receita":"Quiche de Espinafre com Queijo","ingredientes":"1 massa pronta para quiche, 200g de espinafre fresco, 1 xícara de queijo parmesão ralado, 1 xícara de queijo muçarela ralado, 3 ovos, 1 xícara de creme de leite, sal e pimenta a gosto, 1 cebola picada, 2 dentes de alho picados","modo_preparo":"1. Preaqueça o forno a 180°C. 2. Em uma frigideira, refogue a cebola e o alho até ficarem dourados. Adicione o espinafre e refogue até murchar. 3. Em uma tigela, bata os ovos, o creme de leite, o sal e a pimenta. 4. Adicione os queijos e o espinafre refogado à mistura de ovos. 5. Coloque a massa para quiche em uma forma, despeje a mistura sobre a massa. 6. Leve ao forno por aproximadamente 30-35 minutos ou até o recheio estar firme e dourado.","link_imagem":"https://static.itdg.com.br/images/360-240/04f97152aa37bf92d0ae8766fc17ae16/339092-original.jpg","tipo":"salgado","created_at":"2024-08-11T22:03:38.360Z","IngredientesBase":[{"id":4,"nomesIngrediente":["massa para quiche","espinafre","queijo parmesão","queijo muçarela","ovos","creme de leite","sal","pimenta","cebola","alho"],"receita_id":4,"created_at":"2024-08-11T22:03:38.360Z"}]},{"id":5,"receita":"Bolo de Chocolate","ingredientes":"2 xícaras de farinha de trigo, 1 xícara de açúcar, 1 xícara de chocolate em pó, 1 colher de sopa de fermento em pó, 1 xícara de leite, 3 ovos, 1/2 xícara de óleo","modo_preparo":"1. Preaqueça o forno a 180°C. 2. Em uma tigela, misture a farinha, o açúcar, o chocolate em pó e o fermento. 3. Adicione os ovos, o leite e o óleo, e misture bem até obter uma massa homogênea. 4. Despeje a massa em uma forma untada e enfarinhada. 5. Leve ao forno por aproximadamente 35 minutos ou até que, ao espetar um palito, ele saia limpo.","link_imagem":"https://i.ytimg.com/vi/QFMxJWh3mqE/maxresdefault.jpg","tipo":"doce","created_at":"2024-08-11T22:03:48.752Z","IngredientesBase":[{"id":5,"nomesIngrediente":["farinha de trigo","açúcar","chocolate em pó","fermento em pó","leite","ovos","óleo"],"receita_id":5,"created_at":"2024-08-11T22:03:48.752Z"}]},{"id":6,"receita":"Curry de Grão-de-Bico","ingredientes":"2 xícaras de grão-de-bico cozido, 1 cebola picada, 2 dentes de alho picados, 1 pedaço de gengibre ralado, 1 lata de tomates pelados, 1 xícara de leite de coco, 2 colheres de sopa de curry em pó, 1 colher de chá de cominho em pó, 1 colher de chá de açafrão-da-terra, sal e pimenta a gosto, coentro fresco para decorar","modo_preparo":"1. Em uma panela grande, aqueça um pouco de óleo e refogue a cebola, o alho e o gengibre até ficarem dourados. 2. Adicione o curry, o cominho e o açafrão, e cozinhe por 1 minuto. 3. Adicione os tomates pelados e cozinhe por 5 minutos. 4. Acrescente o grão-de-bico cozido e o leite de coco, e deixe cozinhar em fogo baixo por 10 minutos. 5. Tempere com sal e pimenta a gosto. 6. Decore com coentro fresco e sirva com arroz.","link_imagem":"https://i.ytimg.com/vi/YSeE59idBos/maxresdefault.jpg","tipo":"salgado","created_at":"2024-08-13T01:13:57.891Z","IngredientesBase":[{"id":6,"nomesIngrediente":["grão-de-bico","cebola","alho","gengibre","tomates pelados","leite de coco","curry em pó","cominho em pó","açafrão-da-terra","sal","pimenta","coentro"],"receita_id":6,"created_at":"2024-08-13T01:13:57.891Z"}]},{"id":7,"receita":"Torta de Limão","ingredientes":"1 pacote de biscoito de maisena, 100g de manteiga derretida, 1 lata de leite condensado, 1/2 xícara de suco de limão, 1 lata de creme de leite sem soro, raspas de limão para decorar","modo_preparo":"1. Triture os biscoitos de maisena no processador até virar uma farinha fina. 2. Misture a manteiga derretida com os biscoitos triturados até formar uma massa. 3. Forre o fundo de uma forma de torta com a massa e leve ao forno pré-aquecido a 180°C por 10 minutos. 4. Enquanto isso, misture o leite condensado, o suco de limão e o creme de leite até ficar homogêneo. 5. Despeje o recheio sobre a massa assada e leve à geladeira por pelo menos 4 horas. 6. Decore com raspas de limão antes de servir.","link_imagem":"https://i.ytimg.com/vi/cc8QuY7seFQ/maxresdefault.jpg","tipo":"doce","created_at":"2024-08-13T01:14:28.681Z","IngredientesBase":[{"id":7,"nomesIngrediente":["biscoito de maisena","manteiga","leite condensado","suco de limão","creme de leite","raspas de limão"],"receita_id":7,"created_at":"2024-08-13T01:14:28.681Z"}]},{"id":8,"receita":"Risoto de Cogumelos","ingredientes":"2 xícaras de arroz arbóreo, 200g de cogumelos variados fatiados, 1 cebola picada, 2 dentes de alho picados, 1/2 xícara de vinho branco, 1 litro de caldo de legumes, 1/2 xícara de queijo parmesão ralado, 2 colheres de sopa de manteiga, sal e pimenta a gosto, salsinha picada para decorar","modo_preparo":"1. Em uma panela grande, aqueça 1 colher de manteiga e refogue a cebola e o alho até ficarem macios. 2. Adicione os cogumelos e cozinhe até dourar. 3. Acrescente o arroz arbóreo e refogue por 2 minutos. 4. Despeje o vinho branco e cozinhe até evaporar. 5. Adicione o caldo de legumes, uma concha por vez, mexendo sempre, até o arroz ficar al dente e cremoso. 6. Misture o queijo parmesão e a outra colher de manteiga. 7. Tempere com sal e pimenta. 8. Decore com salsinha picada antes de servir.","link_imagem":"https://assets.tmecosys.cn/image/upload/t_web767x639/img/recipe/vimdb/269097.jpg","tipo":"salgado","created_at":"2024-08-13T01:14:56.289Z","IngredientesBase":[{"id":8,"nomesIngrediente":["arroz arbóreo","cogumelos","cebola","alho","vinho branco","caldo de legumes","queijo parmesão","manteiga","sal","pimenta","salsinha"],"receita_id":8,"created_at":"2024-08-13T01:14:56.289Z"}]},{"id":9,"receita":"Cookies de Chocolate","ingredientes":"1 xícara de manteiga, 1 xícara de açúcar mascavo, 1/2 xícara de açúcar branco, 2 ovos, 2 colheres de chá de essência de baunilha, 2 1/4 xícaras de farinha de trigo, 1/2 colher de chá de bicarbonato de sódio, 1/2 colher de chá de sal, 2 xícaras de gotas de chocolate","modo_preparo":"1. Preaqueça o forno a 180°C. 2. Em uma tigela grande, bata a manteiga, o açúcar mascavo e o açúcar branco até ficar cremoso. 3. Adicione os ovos e a essência de baunilha, e misture bem. 4. Em outra tigela, misture a farinha, o bicarbonato de sódio e o sal. 5. Gradualmente, adicione os ingredientes secos à mistura de manteiga, mexendo até incorporar. 6. Adicione as gotas de chocolate e misture até distribuir uniformemente. 7. Com uma colher, coloque porções de massa em uma assadeira forrada com papel manteiga. 8. Asse por 10-12 minutos ou até as bordas estarem douradas. 9. Deixe esfriar antes de servir.","link_imagem":"https://images.aws.nestle.recipes/resized/5b069c3ed2feea79377014f6766fcd49_Original_NTH_Chocolate_Chip_Cookie_1080_850.jpg","tipo":"doce","created_at":"2024-08-13T01:16:05.419Z","IngredientesBase":[{"id":9,"nomesIngrediente":["manteiga","açúcar mascavo","açúcar branco","ovos","essência de baunilha","farinha de trigo","bicarbonato de sódio","sal","gotas de chocolate"],"receita_id":9,"created_at":"2024-08-13T01:16:05.419Z"}]}]
